# Demonstrating the TableOne package

In research papers, it is common for the first table ("Table 1") to display summary statistics of the study data. The `tableone` package is used to create this table. For an introduction to basic statistical reporting in biomedical journals, we recommend reading the [SAMPL Guidelines](http://www.equator-network.org/wp-content/uploads/2013/07/SAMPL-Guidelines-6-27-13.pdf). For more reading on accurate reporting in health research, visit the [EQUATOR Network](http://www.equator-network.org/).

## Installation

To install the package with pip, run the following command in your terminal: ``pip install tableone``. To install the package with Conda, run: ``conda install -c conda-forge tableone``

## Import libraries

Before using the tableone package, we need to import it. We will also import pandas, a popular package for working with data.

In [1]:
# import libraries
from tableone import TableOne
import pandas as pd

## Load sample data

We begin by loading the data that we would like to summarize into a Pandas DataFrame. 
- Variables are in columns
- Encounters/observations are in rows.

In [2]:
# load sample data into a pandas dataframe
url="https://raw.githubusercontent.com/tompollard/data/master/primary-biliary-cirrhosis/pbc.csv"
data=pd.read_csv(url, index_col='id')

In [3]:
data.head()

,time,status,trt,age,sex,ascites,hepato,spiders,edema,bili,chol,albumin,copper,alk.phos,ast,trig,platelet,protime,stage
id,,,,,,,,,,,,,,,,,,,
1,400,2,1.0,58.765229,f,1.0,1.0,1.0,1.0,14.5,261.0,2.60,156.0,1718.0,137.95,172.0,190.0,12.2,4.0
2,4500,0,1.0,56.446270,f,0.0,1.0,1.0,0.0,1.1,302.0,4.14,54.0,7394.8,113.52,88.0,221.0,10.6,3.0
3,1012,2,1.0,70.072553,m,0.0,0.0,0.0,0.5,1.4,176.0,3.48,210.0,516.0,96.10,55.0,151.0,12.0,4.0
4,1925,2,1.0,54.740589,f,0.0,1.0,1.0,0.5,1.8,244.0,2.54,64.0,6121.8,60.63,92.0,183.0,10.3,4.0
5,1504,1,2.0,38.105407,f,0.0,1.0,1.0,0.0,3.4,279.0,3.53,143.0,671.0,113.15,72.0,136.0,10.9,3.0

## Example 1: Simple summary of data with Table 1

In this example we provide summary statistics across all of the data.

In [4]:
# view the tableone docstring
TableOne??

In [5]:
# create an instance of TableOne with the input arguments
# firstly, with no grouping variable
overall_table = TableOne(data)

In [6]:
# view first 10 rows of tableone
overall_table.head(10)

               isnull            overall
variable level
n                                    418
time                0  1917.78 (1104.67)
status   0          0         232 (55.5)
         1                     25 (5.98)
         2                   161 (38.52)
trt      1        106        158 (50.64)
         2                   154 (49.36)
age                 0      50.74 (10.45)
sex      f          0        374 (89.47)
         m                    44 (10.53)

**Summary of the table**:
- the first row ('`n`') displays a count of the encounters/observations in the input data.
- the '`isnull`' column displays a count of the null values for the particular variable.
- if categorical variables are not defined in the arguments, they are detected automatically.
- continuous variables (e.g. '`age`') are summarized by '`mean (std)`'.
- categorical variables (e.g. '`ascites`') are summarized by '`n (% of non-null values)`'.

## Example 2: Table 1 without stratification

In this example we provide summary statistics across all of the data, specifying columns, categorical variables, and non-normal variables.

In [7]:
# list of columns to be included in tableone
columns = ['age','bili','albumin','ast','platelet','protime',
           'ascites','hepato','spiders', 'edema','sex','trt']

# list of columns containing categorical variables
categorical = ['ascites','hepato','edema','sex','spiders','trt']

# optionally, a list of non-normal variables
nonnormal = ['bili']

# optionally, a dictionary of alternative labels for variables
labels = {'sex':'gender', 'trt':'treatment'}

In [8]:
# create an instance of TableOne with the input arguments
# firstly, with no grouping variable
overall_table = TableOne(data, columns, categorical, nonnormal=nonnormal, labels=labels)

In [9]:
# view first 10 rows of tableone
overall_table.head(20)

                isnull           overall
variable  level
n                                    418
age                  0     50.74 (10.45)
bili                 0  1.40 [0.80,3.40]
albumin              0       3.50 (0.42)
ast                106    122.56 (56.70)
platelet            11    257.02 (98.33)
protime              2      10.73 (1.02)
ascites   0.0      106       288 (92.31)
          1.0                  24 (7.69)
hepato    0.0      106       152 (48.72)
          1.0                160 (51.28)
spiders   0.0      106       222 (71.15)
          1.0                 90 (28.85)
edema     0.0        0       354 (84.69)
          0.5                 44 (10.53)
          1.0                  20 (4.78)
gender    f          0       374 (89.47)
          m                   44 (10.53)
treatment 1.0      106       158 (50.64)
          2.0                154 (49.36)

**Summary of the table**:

- as before, except that the variables are explicitly defined in the input arguments.
- continuous variables are now summarized by '`median [IQR]`' if specified as `nonnormal`.
- the labels argument means that 'sex' is now shown as 'gender, and 'trt' is now 'treatment'.

## Example 3: Table 1 with stratification

In this example, we group data across a categorical variable.

In [10]:
# optionally, a categorical variable for stratification
groupby = 'trt'

In [11]:
# create an instance of TableOne with the input arguments
grouped_table = TableOne(data, columns, categorical, groupby, nonnormal)

In [12]:
# view first 10 rows of tableone
grouped_table.head(10)

               Grouped by trt
                       isnull               1.0               2.0
variable level
n                                           158               154
age                         0     51.42 (11.01)      48.58 (9.96)
bili                        0  1.40 [0.80,3.20]  1.30 [0.72,3.60]
albumin                     0       3.52 (0.44)       3.52 (0.40)
ast                       106    120.21 (54.52)    124.97 (58.93)
platelet                   11   258.75 (100.32)    265.20 (90.73)
protime                     2      10.65 (0.85)      10.80 (1.14)
ascites  0.0                0       144 (91.14)       144 (93.51)
         1.0                          14 (8.86)         10 (6.49)
hepato   0.0                0         85 (53.8)        67 (43.51)

**Summary of the table**:
- data is now summarized across the groups specified in the `groupby` argument.
- as before, the summary statistics are either '`mean (std)`', '`median [IQR]`', or '`n (% of non-null values)`'.

## Compute p values

We can run a test to compute p values by setting the ``pval`` argument to True.

In [13]:
# create grouped_table with p values
grouped_table = TableOne(data, columns, categorical, groupby, nonnormal, pval = True)

In [14]:
# view first 10 rows of tableone
grouped_table.head(10)

               Grouped by trt                                             \
                       isnull               1.0               2.0   pval
variable level
n                                           158               154
age                         0     51.42 (11.01)      48.58 (9.96)  0.018
bili                        0  1.40 [0.80,3.20]  1.30 [0.72,3.60]  0.842
albumin                     0       3.52 (0.44)       3.52 (0.40)  0.874
ast                       106    120.21 (54.52)    124.97 (58.93)  0.460
platelet                   11   258.75 (100.32)    265.20 (90.73)  0.555
protime                     2      10.65 (0.85)      10.80 (1.14)  0.197
ascites  0.0                0       144 (91.14)       144 (93.51)  0.567
         1.0                          14 (8.86)         10 (6.49)
hepato   0.0                0         85 (53.8)        67 (43.51)  0.088


                         ptest
variable level
n
age              One-way ANOVA
bili            Kruskal-Wallis
albumin          One-way ANOVA
ast              One-way ANOVA
platelet         One-way ANOVA
protime          One-way ANOVA
ascites  0.0       Chi-squared
         1.0
hepato   0.0       Chi-squared

**Summary of the table**:
- the '`ptest`' column displays the name of the test used to compare the groups.
- the '`pval`' column displays the p value generated by the test in the '`ptest`' column, to 3 decimal places.

## Export the table to file (LaTeX, Markdown, CSV, etc)

Tables can be exported to file in various formats, including:
- LaTeX
- Markdown
- CSV
- HTML

To export the table, call the relevant `to_<format>()` method on the DataFrame.

In [15]:
# Save table to LaTeX
fn = 'tableone.tex'
grouped_table.to_latex(fn)

In [16]:
# Save table to HTML
fn2 = 'tableone.html'
grouped_table.to_html(fn2)